Revit 2021.1 API
BuiltInFailures.WallFailures.ExtrudedWallMustBeVertical Property
 A wall with an edited profile must have a vertical cross-section.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Syntax
C#
public static FailureDefinitionId ExtrudedWallMustBeVertical { get; }
Visual Basic
Public Shared ReadOnly Property ExtrudedWallMustBeVertical As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ExtrudedWallMustBeVertical {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace